// Start 26.10.2023
// Deadline 26.11.2023
// End...

// ---

// Plan for learning JavaScript || ПОЛЬЗОВАТЬСЯ ROAD MAP Какие-то уроки, искать темы.
// Перед тем как приступать к теме, во первых создать подтемы которые нужно будет изучить.

// ---

/*---

1. Контекст this, прототипы, классы 8 A
"Найти один проект на ютубе, сделать его, возможно реализровать что-то небольшое и себе" ...+ 2-3day ++

2. Работа с обьектами 10 S
"Стоит хорошо проработать, возможно с мини проектом" 2-3day ... ++

3. Деструктуризация, оператор Rest 9 S ++
"Стоит хорошо проработать, возможно с мини проектом" 3-5day

4. Таймеры 8 A++
"Не стоит сильно углубляться, что-то маленькое написать возможно" 1-2day

5. Асинхронность 10 S
"Стоит хорошо проработать, возможно с мини проектом" 5-7day ...

6. Запросы на сервер 10 S
"Стоит хорошо проработать, возможно с мини проектом" 5-7day ...

7. Отлов ошибок 7 A
"Не стоит сильно углубляться" 1-2day

8. Регулярные выражения 7 A
"Не стоит сильно углубляться" 1-2day

---*/

// ---

// All 31day + ~Project = 26.11.2023 22:00

// S A B C
// S - Важная тема, обязательна к изучению. Проработка 90-100%
// A - Нужная тема, обязательна к изучению. Проработка 80-90%
// B - Изучить поверхностно
// С - можно временно пропустить
